Управление_квизами_финал/src/DataProcessors/КонфигураторКвиза/КонфигураторКвиза.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>КонфигураторКвиза</name>
  <attributes>
    <name>Квиз</name>
    <type>
      <types>DefinedType.Квиз</types>
    </type>
  </attributes>
  <tabularSections>
    <name>НастройкиРаундов</name>
    <attributes>
      <name>Раунд</name>
      <type>
        <types>DefinedType.Раунд</types>
      </type>
    </attributes>
    <attributes>
      <name>Вопрос</name>
      <type>
        <types>CatalogRef.Вопросы</types>
      </type>
    </attributes>
    <attributes>
      <name>ЭталонныйОтвет</name>
      <type>
        <types>DefinedType.Ответ</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоБаллов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Команды</name>
    <attributes>
      <name>Команда</name>
      <type>
        <types>CatalogRef.Команды</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

Управление_квизами_финал/src/DataProcessors/КонфигураторКвиза/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

Процедура СоздатьНовыйКвиз() Экспорт
	
	ОписаниеКвиза = УправлениеКвизами.НовоеОписаниеКвиза();
	ОписаниеКвиза.Квиз = Квиз;
		
	Для Каждого ВопросРаунда Из НастройкиРаундов Цикл
		ОписаниеВопросаРаунда = УправлениеКвизами.НовоеОписаниеВопросаРаунда();
		ЗаполнитьЗначенияСвойств(ОписаниеВопросаРаунда, ВопросРаунда);
		ОписаниеКвиза.ВопросыРаундов.Добавить(ОписаниеВопросаРаунда);
	КонецЦикла;
	
	Для Каждого КомандаКвиза Из Команды Цикл
		ОписаниеКоманды = УправлениеКвизами.НовоеОписаниеКоманды();
		ЗаполнитьЗначенияСвойств(ОписаниеКоманды, КомандаКвиза);
		ОписаниеКвиза.Команды.Добавить(ОписаниеКоманды);
	КонецЦикла;
	
	УправлениеКвизами.НовыйКвиз(ОписаниеКвиза);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	ТекстОшибки = "";
	
	Если НастройкиРаундов.Количество() = 0 Тогда
		ТекстОшибки = НСтр("ru='Не настроены вопросы по раундам'");
	КонецЕсли;
	
	Если Команды.Количество() = 0 Тогда
		ТекстОшибки = ТекстОшибки + НСтр("ru='Не настроены команды'");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекстОшибки) Тогда
		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки,,,, Отказ);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Иначе
  ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
